cmsis-svd/cmsis-svd/data/Nuvoton/NUC200AE_v1.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PDMA_CH7</name>
      <description>PDMA Register Map</description>
      <groupName>PDMA</groupName>
      <baseAddress>0x50008700</baseAddress>
      <!-- the first addressBlock is occupied by registers. The second block is reserved -> no access permission -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x28</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x80</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
       <register>
          <name>PDMA_CSR0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PDMA_CSR0</displayName>
          <description>PDMA Channel x Control Register</description>
          <addressOffset>0x0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PDMACEN</name>
              <description>PDMA Channel Enable Bit\nSetting this bit to 1 enables PDMA operation. If this bit is cleared, PDMA will ignore all PDMA request and force Bus Master into IDLE state.\n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_RST</name>
              <description>Software Engine Reset\n</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Reset the internal state machine, pointers and internal buffer. The contents of control register will not be cleared. This bit will be automatically cleared after few clock cycles</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE_SEL</name>
              <description>PDMA Mode Selection\n</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Memory to Memory mode (Memory-to-Memory)</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Peripheral to Memory mode (Peripheral-to-Memory)</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Memory to Peripheral mode (Memory-to-Peripheral)</description>
                    <value>#10</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SAD_SEL</name>
              <description>Transfer Source Address Direction Selection\n</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Transfer source address is increasing successively</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Reserved</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Transfer source address is fixed (This feature can be used when data where transferred from a single source to multiple destinations)</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DAD_SEL</name>
              <description>Transfer Destination Address Direction Selection\n</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Transfer destination address is increasing successively</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Reserved</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Transfer destination address is fixed. (This feature can be used when data where transferred from multiple sources to a single destination)</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>APB_TWS</name>
              <description>Peripheral Transfer Width Selection\nNote: This field is meaningful only when MODE_SEL (PDMA_CSRx[3:2]) is Peripheral to Memory mode (Peripheral-to-Memory) or Memory to Peripheral mode (Memory-to-Peripheral).</description>
              <bitOffset>19</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>One word (32-bit) is transferred for every PDMA operation</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>One byte (8-bit) is transferred for every PDMA operation</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>One half-word (16-bit) is transferred for every PDMA operation</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIG_EN</name>
              <description>Trigger Enable Bit\nNote: When PDMA transfer completed, this bit will be cleared automatically.\nIf the bus error occurs, all PDMA transfer will be stopped. Software must reset all PDMA channel, and then trigger again.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PDMA data read or write transfer Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="PDMA_CSR0">
          <name>PDMA_CSR1</name>
          <displayName>PDMA_CSR1</displayName>
          <description>PDMA Channel x Control Register</description>
          <alternateRegister>PDMA_CSR0</alternateRegister>
          <addressOffset>0x0</addressOffset>
       </register>
       <register derivedFrom="PDMA_CSR0">
          <name>PDMA_CSR2</name>
          <displayName>PDMA_CSR2</displayName>
          <description>PDMA Channel x Control Register</description>
          <alternateRegister>PDMA_CSR0</alternateRegister>
          <addressOffset>0x0</addressOffset>
       </register>
       <register derivedFrom="PDMA_CSR0">
          <name>PDMA_CSR3</name>
          <displayName>PDMA_CSR3</displayName>
          <description>PDMA Channel x Control Register</description>
          <alternateRegister>PDMA_CSR0</alternateRegister>
          <addressOffset>0x0</addressOffset>
       </register>
       <register derivedFrom="PDMA_CSR0">
          <name>PDMA_CSR4</name>
          <displayName>PDMA_CSR4</displayName>
          <description>PDMA Channel x Control Register</description>
          <alternateRegister>PDMA_CSR0</alternateRegister>
          <addressOffset>0x0</addressOffset>
       </register>
       <register derivedFrom="PDMA_CSR0">
          <name>PDMA_CSR5</name>
          <displayName>PDMA_CSR5</displayName>
          <description>PDMA Channel x Control Register</description>
          <alternateRegister>PDMA_CSR0</alternateRegister>
          <addressOffset>0x0</addressOffset>
       </register>
       <register derivedFrom="PDMA_CSR0">
          <name>PDMA_CSR6</name>
          <displayName>PDMA_CSR6</displayName>
          <description>PDMA Channel x Control Register</description>
          <alternateRegister>PDMA_CSR0</alternateRegister>
          <addressOffset>0x0</addressOffset>
       </register>
       <register derivedFrom="PDMA_CSR0">
          <name>PDMA_CSR7</name>
          <displayName>PDMA_CSR7</displayName>
          <description>PDMA Channel x Control Register</description>
          <alternateRegister>PDMA_CSR0</alternateRegister>
          <addressOffset>0x0</addressOffset>
       </register>
       <register derivedFrom="PDMA_CSR0">
          <name>PDMA_CSR8</name>
          <displayName>PDMA_CSR8</displayName>
          <description>PDMA Channel x Control Register</description>
          <alternateRegister>PDMA_CSR0</alternateRegister>
          <addressOffset>0x0</addressOffset>
       </register>
       <register>
          <name>PDMA_SAR0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PDMA_SAR0</displayName>
          <description>PDMA Channel x Source Address Register</description>
          <addressOffset>0x4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PDMA_SAR</name>
              <description>PDMA Transfer Source Address Register\nThis field indicates a 32-bit source address of PDMA.\nNote: The source address must be word alignment.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="PDMA_SAR0">
          <name>PDMA_SAR1</name>
          <displayName>PDMA_SAR1</displayName>
          <description>PDMA Channel x Source Address Register</description>
          <alternateRegister>PDMA_SAR0</alternateRegister>
          <addressOffset>0x4</addressOffset>
       </register>
       <register derivedFrom="PDMA_SAR0">
          <name>PDMA_SAR2</name>
          <displayName>PDMA_SAR2</displayName>
          <description>PDMA Channel x Source Address Register</description>
          <alternateRegister>PDMA_SAR0</alternateRegister>
          <addressOffset>0x4</addressOffset>
       </register>
       <register derivedFrom="PDMA_SAR0">
          <name>PDMA_SAR3</name>
          <displayName>PDMA_SAR3</displayName>
          <description>PDMA Channel x Source Address Register</description>
          <alternateRegister>PDMA_SAR0</alternateRegister>
          <addressOffset>0x4</addressOffset>
       </register>
       <register derivedFrom="PDMA_SAR0">
          <name>PDMA_SAR4</name>
          <displayName>PDMA_SAR4</displayName>
          <description>PDMA Channel x Source Address Register</description>
          <alternateRegister>PDMA_SAR0</alternateRegister>
          <addressOffset>0x4</addressOffset>
       </register>
       <register derivedFrom="PDMA_SAR0">
          <name>PDMA_SAR5</name>
          <displayName>PDMA_SAR5</displayName>
          <description>PDMA Channel x Source Address Register</description>
          <alternateRegister>PDMA_SAR0</alternateRegister>
          <addressOffset>0x4</addressOffset>
       </register>
       <register derivedFrom="PDMA_SAR0">
          <name>PDMA_SAR6</name>
          <displayName>PDMA_SAR6</displayName>
          <description>PDMA Channel x Source Address Register</description>
          <alternateRegister>PDMA_SAR0</alternateRegister>
          <addressOffset>0x4</addressOffset>
       </register>
       <register derivedFrom="PDMA_SAR0">
          <name>PDMA_SAR7</name>
          <displayName>PDMA_SAR7</displayName>
          <description>PDMA Channel x Source Address Register</description>
          <alternateRegister>PDMA_SAR0</alternateRegister>
          <addressOffset>0x4</addressOffset>
       </register>
       <register derivedFrom="PDMA_SAR0">
          <name>PDMA_SAR8</name>
          <displayName>PDMA_SAR8</displayName>
          <description>PDMA Channel x Source Address Register</description>
          <alternateRegister>PDMA_SAR0</alternateRegister>
          <addressOffset>0x4</addressOffset>
       </register>
       <register>
          <name>PDMA_DAR0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PDMA_DAR0</displayName>
          <description>PDMA Channel x Destination Address Register</description>
          <addressOffset>0x8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PDMA_DAR</name>
              <description>PDMA Transfer Destination Address Register\nThis field indicates a 32-bit destination address of PDMA.\nNote: The destination address must be word alignment</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
